/**
 * Created by chutaozhang on 2017/4/16.
 */
//省份
var provinceArr = ["省份","福田","南山","罗湖","宝安","龙华新区","龙岗","盐田","光明新区","大鹏新区","坪山新区"];
//城市
var cityArr = [
    ['市区'],
    ['市民中心', '香蜜湖','华强北/华强南','上沙/下沙','益田/福田保税区','车公庙/竹子林','景田', '八卦岭/园岭','皇岗/水围', '梅林','新洲/石厦','CBD中心区','荔枝公园片区'],
    ['华侨城', '白石洲/益田假日','科技园','欢乐海岸','南山中心区/海岸城','南头/桃园','前海', '南油','蛇口/后海', '西丽'],
    ['国贸/金光华', '东门/水贝','万象城/Kkmall','笋岗/银湖','翠竹/东湖','莲塘/梧桐山','黄贝岭/田贝'],
    ['宝安中心区', '西乡','灵芝','新安','沙井','福永','石岩', '固戍/桃源居','松岗', '翻身'],
    ['民治', '梅林关','观澜','大浪','龙华'],
    ['龙岗中心区', '布吉','坂田','横岗','平湖','大运'],
    ['盐田'],
    ['公明'],
    ['大鹏'],
    ['坪山'],
];

var data = [
    {
        "id": 1,
        "name": "深圳市",
        "sub": [
            {
                "id": 2,
                "name": "罗湖区",
                "sub": [
                    {
                        "id": 12,
                        "name": "国贸/金光华"
                    },
                    {
                        "id": 13,
                        "name": "东门/水贝"
                    },
                    {
                        "id": 14,
                        "name": "万象城/Kkmall"
                    },
                    {
                        "id": 15,
                        "name": "笋岗/银湖"
                    },
                    {
                        "id": 16,
                        "name": "翠竹/东湖"
                    },
                    {
                        "id": 17,
                        "name": "莲塘/梧桐山"
                    },
                    {
                        "id": 18,
                        "name": "黄贝岭/田贝"
                    }
                ]
            },
            {
                "id": 3,
                "name": "福田区",
                "sub": [
                    {
                        "id": 19,
                        "name": "市民中心"
                    },
                    {
                        "id": 20,
                        "name": "香蜜湖"
                    },
                    {
                        "id": 21,
                        "name": "华强北/华强南"
                    },
                    {
                        "id": 22,
                        "name": "上沙/下沙"
                    },
                    {
                        "id": 23,
                        "name": "益田/福田保税区"
                    },
                    {
                        "id": 24,
                        "name": "车公庙/竹子林"
                    },
                    {
                        "id": 25,
                        "name": "景田"
                    },
                    {
                        "id": 26,
                        "name": "八卦岭/园岭"
                    },
                    {
                        "id": 27,
                        "name": "皇岗/水围"
                    },
                    {
                        "id": 28,
                        "name": "梅林"
                    },
                    {
                        "id": 29,
                        "name": "新洲/石厦"
                    },
                    {
                        "id": 30,
                        "name": "CBD中心区"
                    },
                    {
                        "id": 31,
                        "name": "荔枝公园片区"
                    }
                ]
            },
            {
                "id": 4,
                "name": "南山区",
                "sub": [
                    {
                        "id": 32,
                        "name": "华侨城"
                    },
                    {
                        "id": 33,
                        "name": "白石洲/益田假日"
                    },
                    {
                        "id": 34,
                        "name": "科技园"
                    },
                    {
                        "id": 35,
                        "name": "欢乐海岸"
                    },
                    {
                        "id": 36,
                        "name": "南山中心区/海岸城"
                    },
                    {
                        "id": 37,
                        "name": "南头/桃园"
                    },
                    {
                        "id": 38,
                        "name": "前海"
                    },
                    {
                        "id": 39,
                        "name": "南油"
                    },
                    {
                        "id": 40,
                        "name": "蛇口/后海"
                    },
                    {
                        "id": 41,
                        "name": "西丽"
                    }
                ]
            },
            {
                "id": 5,
                "name": "宝安区",
                "sub": [
                    {
                        "id": 42,
                        "name": "宝安中心区"
                    },
                    {
                        "id": 43,
                        "name": "西乡"
                    },
                    {
                        "id": 44,
                        "name": "灵芝"
                    },
                    {
                        "id": 45,
                        "name": "新安"
                    },
                    {
                        "id": 46,
                        "name": "沙井"
                    },
                    {
                        "id": 47,
                        "name": "福永"
                    },
                    {
                        "id": 48,
                        "name": "石岩"
                    },
                    {
                        "id": 49,
                        "name": "固戍/桃源居"
                    },
                    {
                        "id": 50,
                        "name": "松岗"
                    },
                    {
                        "id": 51,
                        "name": "翻身"
                    }
                ]
            },
            {
                "id": 6,
                "name": "龙岗区",
                "sub": [
                    {
                        "id": 52,
                        "name": "龙岗中心区"
                    },
                    {
                        "id": 53,
                        "name": "布吉"
                    },
                    {
                        "id": 54,
                        "name": "坂田"
                    },
                    {
                        "id": 55,
                        "name": "横岗"
                    },
                    {
                        "id": 56,
                        "name": "平湖"
                    },
                    {
                        "id": 57,
                        "name": "大运"
                    }
                ]
            },
            {
                "id": 7,
                "name": "盐田区",
                "sub": [
                    {
                        "id": 58,
                        "name": "盐田"
                    }
                ]
            },
            {
                "id": 8,
                "name": "龙华新区",
                "sub": [
                    {
                        "id": 59,
                        "name": "民治"
                    },
                    {
                        "id": 60,
                        "name": "梅林关"
                    },
                    {
                        "id": 61,
                        "name": "观澜"
                    },
                    {
                        "id": 62,
                        "name": "大浪"
                    },
                    {
                        "id": 63,
                        "name": "龙华"
                    }
                ]
            },
            {
                "id": 9,
                "name": "光明新区",
                "sub": [
                    {
                        "id": 64,
                        "name": "公明"
                    }
                ]
            },
            {
                "id": 10,
                "name": "大鹏新区",
                "sub": [
                    {
                        "id": 65,
                        "name": "大鹏"
                    }
                ]
            },
            {
                "id": 11,
                "name": "坪山新区",
                "sub": [
                    {
                        "id": 66,
                        "name": "坪山"
                    }
                ]
            }
        ]
    }
]